Tekla.Structures.AnalysisInternal.DotAnalysisVolume
The serialization structure for AnalysisVolume.

Tekla.Structures.AnalysisInternal.DotAnalysisVolume._AnalysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisVolume._Material
The material of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisVolume._Profile
The profile of the analysis part.

Tekla.Structures.AnalysisInternal.DotAnalysisVolume._Volume
The volume item.

Tekla.Structures.AnalysisInternal.DotAnalysisVolume.VolumeHoles
The volume holes.

Tekla.Structures.AnalysisInternal.DotAnalysisVolume.ToStruct(Tekla.Structures.Analysis.AnalysisVolume)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisVolume.FromStruct(Tekla.Structures.Analysis.AnalysisVolume)
DO NOT USE! For internal usage only!
P: P.